<template>
  <a-card class="result-error" :bordered="false">
    <a-row :gutter="[20, 12]">
      <h2>供应商注册须知</h2>
      <a-col align="left">
        无锡尚德太阳能电力有限公司（以下简称"本公司"）依据以下条件和条款提供您所享有的服务。
      </a-col>
      <a-col align="left">
        本协议阐述之条款和条件适用于您使用尚德电力电子采购平台（以下简称"本平台"），参与本公司或本公司关联公司（合称"尚德电力企业"）竞价、竞买等活动。
      </a-col>
      <a-col align="left">
        一、以任何方式进入本平台即表示您同意自己已经与本公司订立本协议，且您将受本协议的条款和条件约束。本平台可随时自行全权决定更改"条款"。如"条款"有任何变更，将在网站上刊载公告，通知予您。如您不同意相关变更，必须停止使用本平台。经修订的"条款"。<br />一经网站的公布后，立即自动生效。您应在第一次登录后仔细阅读修订后的"条款"，并有权选择停止继续使用本平台；一旦您继续使用本平台，则表示您已接受经修订的"条款"，当您与本公司发生争议时，应以最新的条款为准。
      </a-col>
      <a-col align="left">
        二、本平台仅供能够根据相关法律订立具有法律约束力的合约的公司使用。因此，您的公司必须是经国家主管部门注册的法人企业，才可使用本公司平台。如不符合本项条件，请勿使用本平台。本平台可随时自行全权决定拒绝向不合法企业供应商提供"服务"。<br />本协议甲方为"尚德电力电子采购平台"（简称平台）的提供者，乙方为卖方供应商（供应商），双方经共同协商，就乙方使用本平台开展服务达成如下协议。
      </a-col>
      <a-col align="left">
        三、平台内容<br />1、平台定义：尚德电力电子采购平台是由本公司提供的用于网上执行竞价、竞买等业务的平台。<br />2、供应商注册：供应商注册是指供应商登陆平台，并按要求填写相关信息并确认同意相关服务协议的过程。供应商因进行交易、获取有偿服务或接触平台服务而发生的所有应纳税赋，以及一切硬件、软件、服务及其他方面的费用均由供应商负责支付。平台仅作为供应商就货物和服务的交易进行竞价、协商，以及获取各类与贸易相关的服务的工具。<br />3、版权：本网站的图形、图像、文字及其程序等所有内容均受《中华人民共和国著作权法》及相关法律法规和中国加入的所有知识产权方面的国际条约的保护。本公司对本网站内容享有完整的著作权，未经允许，不得以任何形式复制和采用或将其提供给任何第三方。在内容不作任何修改、保留性内容未做修改以及未得到本公司的书面许可的情况下，网上资料不可作为网外信息用于任何用户自身商业性的用途。任何用户不得擅自复制本公司所创造用于制成网页的HTML文件。本公司对其HTML文件享有著作权。同时本公司对本网站上的所有图标、图饰、形状、图表、色彩、文字表述及其组合、版面设计、数据库均享有完全的著作权，对发布的信息均享有专有的发布、修改和使用权，未经本公司书面同意，任何用户不得擅自复制、使用、转载或将其提供给任何第三方。<br />4、信息的安全性：任何人不得破坏或企图破坏本公司网站的安全，其中包括但不限于：接触未经许可的数据或进入未经许可的服务器或帐户；没有得到许可，企图探查、扫描或测试系统或网络的弱点，或者破坏安全措施；企图干涉对用户及网络的服务，包括并不限于通过超载、
        "邮件炸弹"或"摧毁"等手段，发送促销、产品广告及服务的E-mail；伪造TCP/IP数据包名称或部分名称。破坏系统或网络可能导致犯罪，本公司将调查、干预此类破坏行为的发生，并将与执法当局合作，起诉此类破坏行为的使用者。<br />5、信息更改与删除：除了信息的发布者外，任何访问者不得更改或删除他人发布的任何信息。但本公司有权根据判断保留修改或删除任何不适当的信息。
      </a-col>
      <a-col align="left">
        四、平台的权利和义务：<br />
        1、本公司有义务在现有技术上确保整个电子采购平台的正常运行，并努力提升和改进技术，保证供应商网上交易活动的顺利进行。有权对供应商的注册资料及交易行为进行查阅，发现或怀疑注册资料或交易行为中存在任何问题，均有权向供应商发出询问及要求改正的通知并作出删除等处理。<br />
        2、本公司就平台的使用对供应商进行指导培训，对供应商在使用平台中所遇到的问题及反映的情况，有义务及时作出回复并解决。<br />
        3、经本公司主管部门通知已被取消供应商资格的，本公司有权通知供应商后作出删除相关信息、终止服务直至取消供应商资格等处理，而无须征得供应商的同意。<br />
        4、本平台不能控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易方履行其在贸易协议项下的各项义务的能力。本公司不会就通过"服务"传送的任何资料的准确性、有用性或可用性、可获利性负责或承担任何责任，且不会对根据该资料而作出的任何交易或投资决策负责或承担任何责任。
      </a-col>
      <a-col align="left">
        五、供应商的权利和义务<br />
        1、供应商有权利拥有自己的用户名及密码，并有权利使用自己的用户名及密码随时登陆尚德电力电子采购平台，参加本平台上进行的竞价业务。供应商不得以任何形式擅自转让或授权他人使用自己的供应商名。供应商对本单位所申请的帐号和密码安全负全部责任，由于非本公司原因造成供应商的账号和密码外泄、被人冒充竞价、或者被人利用传播非法信息，并由此造成的损失和责任本公司概不负责，如用户名或密码丢失被盗，应立即通知本公司，由本公司管理员取消原密码并重新设置新密码。如因供应商的原因而给本公司造成损失的，本公司有权追偿。<br />
        2、供应商有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，同时向平台提交必要的合法企业证明。同时，供应商也有义务在相关资料实际变更时及时更新有关注册资料。供应商保证不以他人资料在尚德电力电子采购平台进行注册或认证。否则，由此而产生的任何违约、赔偿等全部责任由供应商承担。<br />
        3、供应商有权根据本平台的规定以及平台上发布的相关规则发布、修改报价信息、参加网上采购竞价、物品竞买以及有权享受平台提供的其他的有关信息服务，并保证所发布的信息真实合法有效。<br />
        4、供应商接受本公司不定时地向其信箱发送资料，任何用户不得使用本公司供应商信息注册网站发送或储存任何违反适用法律或法规的资料；不得以任何形式侵犯他人的版权、商标权、商业秘密或其他知识产权；不得侵犯个人和社会大众的隐私安全；禁止传输任何非法的、骚扰性的、中伤性的、辱骂性的、恐吓性的、伤害性、庸俗或淫秽的信息。任何用户不得发布任何于本网站不适当之信息；任何用户不得发布任何不完整、不准确、虚假的或具有误导性的信息；任何用户对所发布的信息承担完全责任。<br />
        5、供应商使用本平台进行服务发生的所有应纳税赋，以及相关硬件、软件、服务及其他方面的费用均由供应商自行负责。<br />
      </a-col>
      <a-col align="left">
        六、费用<br />
        1、供应商参加在本平台上进行的竞价竞买业务，根据采购项目的要求缴纳相关费用，本平台不另行收取费用。<br />
        2、本平台由本公司投资建设，免费提供给尚德电力的供应商使用，任何单位和个人不得以任何名义向供应商收取与平台使用权相关的费用。<br />
      </a-col>
      <a-col align="left">
        七、服务的中断和终止<br />
        1、供应商同意，本平台可自行全权决定终止供应商的密码、帐号和服务，并删除和丢弃供应商资料。同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供服务或其任何部份。帐号终止后，平台没有义务为供应商保留与之相关的任何信息，不会就终止服务而对供应商或任何第三者承担任何责任。<br />
        2、供应商向平台提出注销供应商身份，经平台确认双方无任何经济纠纷后，由平台注销注册供应商，供应商即解除服务协议关系；平台发现供应商注册资料中主要内容是虚假的，经通知不及时修正的，本公司可以随时单方面终止与该供应商的服务协议。<br />
        3、本服务协议终止或更新时，供应商未确认新的服务协议的，视为双方自动解约。<br />
      </a-col>
      <a-col align="left">
        八、免责条款<br />
        1、供应商明确理解和同意，本公司不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿：<br />
        （1）由于本公司预先通知进行服务器配置、维护时需要短时间中断服务，或者由于Internet
        通路的阻塞，或因网络问题、黑客、病毒、技术调整等引起的事件，由此造成的服务器访问速度下降或任何形式的数据丢失；<br />
        （2）遇有不能预见、不能避免或不能克服的客观事件，包括但不限于自然灾害（如洪水、火灾、爆炸、雷电、地震和风暴等）以及社会事件(如战争、动乱、政府管制、国家政策的突然变动和罢工等)。<br />
        （3）供应商同意，因供应商违反本协议或经在此提及而纳入本协议的其他文件，或因供应商违反了法律或侵害了第三方的权利，第三方提出的索赔要求（包括司法费用和其他专业人士的费用），由供应商自行负责，与本平台无关。
      </a-col>
      <a-col align="left">
        九、违约责任及争议解决<br />
        1、如果供应商使用本平台，参加尚德电力企业的报价或竞价等活动，在竞价胜出后其又不履行的，需向本公司支付相应违约金。违约金按最终胜出的竞价价款总额的30%计算。如给本公司或尚德电力企业造成的损失超过违约金数额的，超过部分仍需赔偿。<br />
        2、在使用本平台的过程中如发生争议，双方应友好协商解决，如协商不成，可诉讼至本公司所在地有管辖权的人民法院。
      </a-col>
    </a-row>
    <a-form-model>
      <a-form-model-item>
        <a-checkbox :checked="checked" @change="onChange">
          我已阅读并同意该条款
        </a-checkbox>
      </a-form-model-item>
    </a-form-model>

    <div>
      <a-button type="primary" @click="readingClick"> 同意 </a-button>
      <a-button @click="returnback" style="margin-left: 8px"> 返回 </a-button>
    </div>
  </a-card>
</template>

<script>
// import { el } from 'date-fns/locale'
export default {
  name: "reading",
  data() {
    return {
      checked: false,
    }
  },
  methods: {
    onChange() {
      this.checked = !this.checked
    },
    readingClick() {
      if (this.checked) {
        this.$emit("on-reading")
      } else {
        this.$message.warning("未同意该条款")
      }
    },
    returnback() {
      this.$router.push("/login")
    },
  },
}
</script>

<style scoped lang="less">
.result-error {
  span {
    text-indent: 30px;
    text-align: left;
  }
}
</style>
