<template>
    <a-card class="result-error" :bordered="false">
        <div>
            <h2>供应商注册须知</h2>
            <p>根据《中华人民共和国合同法》、《全国人大常委会关于维护互联网安全的决定》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》等有关法律、法规、规章，制订本须知。</p>
            <p> 以下条款和内容（下称“条款”），适用于以任何方式注册和使用江苏恒云太科技有限公司（以下统称“XDC”）电子采购系统（以下简称“系统”）的供应商用户（以下简称“用户”）。凡注册和使用电通系统的用户，须认真阅读本注册须知，用户点击同意并继续按钮的，即视为用户对以下条款理解准确无任何异议，并同意接受其约束，本用户注册须知即刻对电通和用户双方产生法律约束力，为便于平台对用户的管理，用户还应按照系统要求上传加盖公章后的注册须知扫描件；如供应商用户对以下条款有异议，不同意接受以下条款约束的，请点击取消按钮，退出系统注册。</p>
            <p>本用户同意以下条款：</p>
            <p>1. 系统及其所有内容（包括但不限于文字、说明、图片、图形、页面设计等）之著作权皆归电通所有，任何人未经书面授权，不得就系统及其他内容享有任何权利。用户认可：系统及XDC提及的任何产品或公司之名称，用户不因进入及使用系统即表示经明示或默示而有权使用出现在系统的商标，除非用户已获得电通或相关权利人之事先书面许可。</p>
            <p>2.用户在注册使用系统提供的服务时，应按照系统要求提供真实、准确、完整的资料和信息，并确保所有提供资料和信息符合国家相关法律法规规定，不侵犯任何第三方合法权益，否则电通有权立即终止与用户之间的任何合作，由此导致的全部法律责任和后果由用户自行承担。</p>
            <p>3. 用户承诺，用户上传至系统的所有扫描文件内容与原件内容完全一致，并具有同等法律效力，用户认可任何通过系统查看及下载的扫描文件是真实、有效、合法的文件，并不对此提出任何质疑。电通有权查看、下载该扫描文件，但不得将该扫描文件用于非法用途。</p>
            <p>4.用户有权利使用自己的用户账号和密码随时登录系统，查阅本网站发布的采购公告或提交相关报价信息等的权利，但请务必妥善保存好用户账号和密码，不得以任何形式擅自转让或授权用户以外第三方使用用户系统账号和密码。登录用户账户进行的所有操作均完全等同于用户自身真实的行为和意思表示，用户须对其帐号中的所有操作承担全部责任。若用户发现任何非法使用用户帐号或安全漏洞的情况，应立即通告电通。任何非甲方原因导致的用户账号及密码泄露所引起或产生的任何纠纷或损失，将由用户自行承担，电通不承担任何责任。</p>
            <p>5.用户有义务在注册时提供其真实有效的资料和信息，并保证诸如公司地址、电子邮件地址、联系人及其联系电话、地址等内容的准确完整，保证电通可以通过上述系方式与用户进行联系；如系统上任何用户资料发生变更，用户有义务及时更新。如用户提供的资料不完整或者用户提供的资料包含有不正确或不准确的信息，由此相关的一切后果均应当由用户自行承担。</p>
            <p>6.用户有权对相关业务人员的违法、违规行为进行投诉。用户不得利用系统及系统帐号进行数据破坏活动及其他相关法律法规禁止的非法行为，不得使用同一IP地址登陆两个及以上用户账号，一经查实，电通将对用户暂时取消报价资格，待后续处理结束后，视情况决定用户是否可继续使用其帐户并进行报价。</p>
            <p>7.用户授权电通有权随时查阅和使用用户资料和信息。但电通不会公开透露用户的不可公开的注册资料及用户在系统中保存的非公开内容，除非：</p>
            <p>（一）有关法律、法规、规章的强制性规定;</p>
            <p>（二）与司法、行政、诉讼、争议解决相关的事宜，包括但不限于公证、调查、证据提交等;</p>
            <p>（三）保持或维护系统的合法运营，包括但不限于系统运维服务方可获取、使用用户信息等;</p>
            <p>（四）其他电通合理授权第三方获取、使用用户信息的情况。</p>
            <p>8. 免责条款：电通无法预见客观环境的改变及任何技术上的问题（包括但不限于：计算机病毒攻击、黑客入侵、网络断等），由此导致的数据损失或其他服务中断等情形，会员用户对此应表示理解，并同意自行承担利用系统操作的所有风险。</p>
            <p>9. 利用系统报价相关的重要提示：</p>
            <p>9.1用户在系统的注册成功及其他应电通要求提供信息或通过系统进行相关操作（包括但不限于提交报价单、相关说明、保证和承诺、投标文件等），并不能替代用户在投标（或其他采购竞争方式）时电通和/或其代理机构、合作方对该用户资质和履约能力的实质性审查，同时并不意味着电通与该用户就相关项目达成任何倾向性的合意和/或任何明示/默示的合同/协议或授权、委托，任何项目的授权、委托、合作等均应以电通与用户双方最终签署的合同/协议为准。</p>
            <p>9.2用户应于电通要求的时间内提交报价，逾期未提交或提交不合格的，视为用户自动放弃本次项目报价，但特殊情形下经用户申请且电通书面确认的除外；用户一旦提交报价，即具有法律效力，未经电通书面确认，用户不得随意更改、撤销报价；除双方另有约定外，用户每次报价应包括包装费、运费及相关税费等，且应按照甲方要求运送至指定地点，并提供相关产品质保书及证书等；报价单应按照电通要求的格式填写，否则视为不合格报</p>    
        </div>
        <a-form-model>
            <a-form-model-item>
                <a-checkbox :checked="checked" @change="onChange">
                    我已阅读并同意该条款
                </a-checkbox>
            </a-form-model-item>
        </a-form-model>
        
       <div>
           <a-button type="primary" @click="readingClick"> 同意 </a-button>
           <a-button @click="returnback" style="margin-left: 8px"> 返回 </a-button>
       </div>
    </a-card>
</template>

<script>
// import { el } from 'date-fns/locale'
export default {
  name: 'reading',      
  data () {
    return {
        checked: false
    }
  },
       methods: {
           onChange(){
               this.checked = !this.checked
           },
           readingClick(){
               if(this.checked){
               this.$emit('on-reading')
               }else{
                   alert('未同意该条款')
               }
           },
           returnback(){
               this.$router.push('/login')
           }
  },
}
</script>

<style scoped lang="less">
.result-error{
 p{
     text-indent: 30px;
     text-align: left;
 }
}
</style>
